Second Highest Salary

In [1]:
import pandas as pd

In [2]:
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id': 'int64', 'salary': 'int64'})

In [3]:
employee

   id  salary
0   1     100
1   2     200
2   3     300

In [6]:
employee['rank'] = employee[['salary']].rank(method='dense', ascending=False)

In [7]:
employee

   id  salary  rank
0   1     100   3.0
1   2     200   2.0
2   3     300   1.0

In [9]:
employee[employee['rank'] == 2][['salary']].rename(columns={'salary': 'SecondHighestSalary'})

   SecondHighestSalary
1                  200